#pragma once

/*Поле first — ціле додатнє число, номінал купюри; номінал може приймати значення 1, 2, 5, 10, 20, 50, 100, 500, 1000. Поле second — ціле додатнє число, кількість купюр даного номіналу. Реалізувати метод summa() — обчислення грошової суми.*/

// Структура для зберігання інформації про купюри
struct money
{
    int first;   // номінал купюри
    int second;  // кількість купюр

    void Init(int f, int s);  // ініціалізація та перевірка даних
    void Read();              // введення даних з клавіатури
    void Display();           // виведення даних на екран
    long long summa();        // обчислення загальної суми
};